def triangle(a, h):
    '''на вход принимает значение переменной a (основания треугольника) и переменной h (высоты треугольника). 
    Возвращает числовое значение площади фигуры.'''
    return a*h

def rectangle(a,b):
    '''на вход принимает значение переменных a (длина прямоугольника) и b (ширина прямоугольника).
    Возвращает числовое значение площади фигуры.'''
    return a*b

def circle (r):
    '''на вход принимает значение переменной r (радиус круга). 
    Возвращает числовое значение площади фигуры.'''
    return 3,14*(r**2)